##### 1. Connecting with database
First lines enable connection to database created in MySQL:

In [1]:
%load_ext sql

%sql mysql://root:password@localhost/shop

##### 2. Looking at the available tables in database

In [2]:
%sql select * from customers limit 5

 * mysql://root:***@localhost/shop
5 rows affected.

[(1, 'Max', 'Mustermann', 35, 'Berlin'),
 (2, 'Alan', 'Parker', 42, 'London'),
 (3, 'Maria', 'Solska', 32, 'Warsaw'),
 (4, 'Martina', 'Mueller', 27, 'Dortmund'),
 (5, 'Uwe', 'Hermann', 51, 'Berlin')]

In [3]:
%sql select * from products limit 5

 * mysql://root:***@localhost/shop
5 rows affected.

[(1, 'FG Shoes', 129.99),
 (2, 'SG Shoes', 139.9),
 (3, 'AG Shoes', 99.95),
 (4, 'TF Shoes', 84.95),
 (5, 'IC Shoes', 79.99)]

In [4]:
%sql select * from orders limit 5

 * mysql://root:***@localhost/shop
5 rows affected.

[(1, datetime.datetime(2023, 3, 10, 23, 21, 29), 2, 3),
 (2, datetime.datetime(2023, 3, 10, 23, 21, 29), 7, 5),
 (3, datetime.datetime(2023, 3, 10, 23, 21, 29), 1, 4),
 (4, datetime.datetime(2023, 3, 10, 23, 21, 29), 4, 4),
 (5, datetime.datetime(2023, 3, 10, 23, 21, 29), 3, 3)]

##### 3. Getting whole overview of the orders

To get an overview of the whole sale, tables were **JOINED** and the most important elements from tables were extracted. To reduce the space the output is limited to 5 records. 
The joined tabels are showing now the simple overview with orders data and corresponding products & customers data.

In [5]:
%%sql
select o.OrderDate, p.ProductName, p.Price, c.* 
from Orders as o
inner join Products as p on o.ProductId=p.ProductId
inner join Customers as c on o.CustomerId=c.CustomerId
order by OrderDate
limit 5;

 * mysql://root:***@localhost/shop
5 rows affected.

[(datetime.datetime(2023, 3, 10, 23, 21, 29), 'AG Shoes', 99.95, 2, 'Alan', 'Parker', 42, 'London'),
 (datetime.datetime(2023, 3, 10, 23, 21, 29), 'IC Shoes', 79.99, 7, 'Max', 'Mueller', 28, 'Berlin'),
 (datetime.datetime(2023, 3, 10, 23, 21, 29), 'TF Shoes', 84.95, 1, 'Max', 'Mustermann', 35, 'Berlin'),
 (datetime.datetime(2023, 3, 10, 23, 21, 29), 'TF Shoes', 84.95, 4, 'Martina', 'Mueller', 27, 'Dortmund'),
 (datetime.datetime(2023, 3, 10, 23, 21, 29), 'AG Shoes', 99.95, 3, 'Maria', 'Solska', 32, 'Warsaw')]

##### 4. Checking the total amount spent

The next step was to get the total amount spent using **SUM** function and **CAST** to get the correct float with 2 decimals.

In [6]:
%%sql
select cast(sum(p.Price) as decimal (10,2)) as Total
from Orders as o
inner join Products as p on o.ProductId=p.ProductId
inner join Customers as c on o.CustomerId=c.CustomerId;

 * mysql://root:***@localhost/shop
1 rows affected.

[(Decimal('1599.26'),)]

##### 5. Checking the total amount spent by each customer

Using above functions and **GROUP BY** statement, the total amount spent by each customer were extracted and presented in table below.

In [7]:
%%sql
select c.LastName, cast(sum(p.Price) as decimal (5,2)) as Total
from Orders as o
inner join Products as p on o.ProductId=p.ProductId
inner join Customers as c on o.CustomerId=c.CustomerId
group by c.LastName;

 * mysql://root:***@localhost/shop
6 rows affected.

[('Mustermann', Decimal('494.74')),
 ('Hermann', Decimal('259.98')),
 ('Parker', Decimal('379.75')),
 ('Solska', Decimal('99.95')),
 ('McColley', Decimal('199.90')),
 ('Mueller', Decimal('164.94'))]

##### 6. Checking the sales register

**GROUP BY, ORDER BY** statements and **COUNT** function were used to create sales register with amount of sold products.

In [8]:
%%sql
select p.ProductName, count(p.ProductName) as Amount
from Orders as o
inner join Products as p on o.ProductId=p.ProductId
inner join Customers as c on o.CustomerId=c.CustomerId
group by p.ProductName
order by count(p.ProductName) DESC, p.ProductName;

 * mysql://root:***@localhost/shop
5 rows affected.

[('AG Shoes', 4),
 ('SG Shoes', 4),
 ('FG Shoes', 3),
 ('TF Shoes', 2),
 ('IC Shoes', 1)]